Repository: CesarTransifex/myrepo
Catalog: Translations/*/txgh-backend.po
Languages: es

source: Email address is required.
es: Las direcciones de correo electrónico son obligatorias.

source: Email address must have @ symbol.
es: La dirección de correo electrónico debe tener el símbolo @.

source: Enter a valid email address.
es: Introduzca una dirección de correo electrónico válida.

source: %s is an invalid domain.
es: %s es un dominio no válido.

source: Page Not Found
es: Página no encontrada

source: Oops!
es: ¡Ups!

source: 404 error, this page does not exist. Either the link is outdated or the address is mistyped.
es: Error 404, esta página no existe. O el enlace está desactualizado o la dirección está mal escrita.

source: Back to homepage
es: Volver a la página de inicio

source: Internal Server Error
es: Error Interno del Servidor

source: 500 error, there is a problem loading this data. Check back in a little while.
es: 500 error, hay un problema al cargar estos datos. Vuelva a consultar en un rato.

source: You've been logged out of Betterworks
es: Has sido desconectado de Betterworks

source: To access Betterworks, please click the link below.
es: Para acceder a Betterworks, haga clic en el siguiente enlace.

source: Access Betterworks
es: Acceder a Betterworks

source: Hi, Betterworks would like to access your account:
es: Hola, Betterworks desea acceder a su cuenta:

source: Allow
es: Permitir
